## 021 データを読み込む

In [1]:
import pandas as pd
import seaborn as sns
import numpy as np

In [2]:
uselog = pd.read_csv('./input/100knoks/03/use_log.csv')
print(len(uselog))
uselog.head()

197428

            log_id customer_id     usedate
0  L00000049012330    AS009373  2018-04-01
1  L00000049012331    AS015315  2018-04-01
2  L00000049012332    AS040841  2018-04-01
3  L00000049012333    AS046594  2018-04-01
4  L00000049012334    AS073285  2018-04-01

In [3]:
customer_master = pd.read_csv('./input/100knoks/03/customer_master.csv')
print(len(customer_master))
customer_master.head()

4192

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0
4,HD661448,XXXXX,C03,F,2015-05-01 00:00:00,NaN,CA1,0

In [4]:
class_master = pd.read_csv('./input/100knoks/03/class_master.csv')
print(len(class_master))
class_master.head()

3

  class class_name  price
0   C01     オールタイム  10500
1   C02      デイタイム   7500
2   C03        ナイト   6000

In [5]:
campaign_master = pd.read_csv('./input/100knoks/03/campaign_master.csv')
print(len(campaign_master))
campaign_master.head()

3

  campaign_id campaign_name
0         CA1            通常
1         CA2         入会費半額
2         CA3         入会費無料

## 022 顧客データの整形

In [6]:
customer = pd.merge(customer_master, class_master, on='class', how='left')
customer = pd.merge(customer, campaign_master, on='campaign_id', how='left')
customer

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price,campaign_name
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
4,HD661448,XXXXX,C03,F,2015-05-01 00:00:00,NaN,CA1,0,ナイト,6000,通常
...,...,...,...,...,...,...,...,...,...,...,...
4187,HD676663,XXXX,C01,M,2019-03-14 00:00:00,NaN,CA1,0,オールタイム,10500,通常
4188,HD246549,XXXXX,C01,F,2019-03-14 00:00:00,NaN,CA1,0,オールタイム,10500,通常
4189,GD037007,XXXXX,C03,M,2019-03-14 00:00:00,NaN,CA1,0,ナイト,6000,通常
4190,OA953150,XXXXX,C01,M,2019-03-14 00:00:00,NaN,CA1,0,オールタイム,10500,通常
4191,IK692635,XXXXX,C02,F,2019-03-15 00:00:00,NaN,CA1,0,デイタイム,7500,通常

In [7]:
customer.isnull().sum()

customer_id         0
name                0
class               0
gender              0
start_date          0
end_date         2842
campaign_id         0
is_deleted          0
class_name          0
price               0
campaign_name       0
dtype: int64

## 023 顧客データの基礎集計

In [8]:
customer.groupby('class_name').count()['customer_id']

class_name
オールタイム    2045
デイタイム     1019
ナイト       1128
Name: customer_id, dtype: int64

In [9]:
customer.groupby('campaign_name').count()['customer_id']

campaign_name
入会費半額     650
入会費無料     492
通常       3050
Name: customer_id, dtype: int64

In [10]:
customer.groupby('gender').count()['customer_id']

gender
F    1983
M    2209
Name: customer_id, dtype: int64

In [11]:
customer.groupby('is_deleted').count()['customer_id']

is_deleted
0    2842
1    1350
Name: customer_id, dtype: int64

In [12]:
customer['start_date'] = pd.to_datetime(customer['start_date'])
customer_start = customer.loc[customer['start_date'] > pd.to_datetime('2018-4-1')]
print(customer_start)
print(len(customer_start))

     customer_id   name class gender start_date             end_date  \
2831    HI195873    XXX   C01      F 2018-04-02  2018-08-31 00:00:00
2832    TS322485     XX   C03      F 2018-04-02  2018-08-31 00:00:00
2833    IK552971  XXXXX   C02      F 2018-04-02  2018-08-31 00:00:00
2834    PL000560    XXX   C01      M 2018-04-02  2018-07-31 00:00:00
2835    HD218970  XXXXX   C01      F 2018-04-02  2018-11-30 00:00:00
...          ...    ...   ...    ...        ...                  ...
4187    HD676663   XXXX   C01      M 2019-03-14                  NaN
4188    HD246549  XXXXX   C01      F 2019-03-14                  NaN
4189    GD037007  XXXXX   C03      M 2019-03-14                  NaN
4190    OA953150  XXXXX   C01      M 2019-03-14                  NaN
4191    IK692635  XXXXX   C02      F 2019-03-15                  NaN

     campaign_id  is_deleted class_name  price campaign_name
2831         CA3           1     オールタイム  10500         入会費無料
2832         CA3           1        ナイト   6000         入会費無料
2833         CA3           1      デイタイム   7500         入会費無料
2834         CA3           1     オールタイム  10500         入会費無料
2835         CA3           1     オールタイム  10500         入会費無料
...          ...         ...        ...    ...           ...
4187         CA1           0     オールタイム  10500            通常
4188         CA1           0     オールタイム  10500            通常
4189         CA1           0        ナイト   6000            通常
4190         CA1           0     オールタイム  10500            通常
4191         CA1           0      デイタイム   7500            通常

[1361 rows x 11 columns]
1361

## 024 最新顧客データの基礎集計をしてみる

In [13]:
customer['end_date'] = pd.to_datetime(customer['end_date'])
customer_newer = customer.loc[(customer['end_date'] >= pd.to_datetime('20190331')) | (customer['end_date'].isna())]
print(customer_newer)
print(customer_newer['end_date'].unique())

     customer_id   name class gender start_date end_date campaign_id  \
0       OA832399   XXXX   C01      F 2015-05-01      NaT         CA1
1       PL270116  XXXXX   C01      M 2015-05-01      NaT         CA1
2       OA974876  XXXXX   C01      M 2015-05-01      NaT         CA1
3       HD024127  XXXXX   C01      F 2015-05-01      NaT         CA1
4       HD661448  XXXXX   C03      F 2015-05-01      NaT         CA1
...          ...    ...   ...    ...        ...      ...         ...
4187    HD676663   XXXX   C01      M 2019-03-14      NaT         CA1
4188    HD246549  XXXXX   C01      F 2019-03-14      NaT         CA1
4189    GD037007  XXXXX   C03      M 2019-03-14      NaT         CA1
4190    OA953150  XXXXX   C01      M 2019-03-14      NaT         CA1
4191    IK692635  XXXXX   C02      F 2019-03-15      NaT         CA1

      is_deleted class_name  price campaign_name
0              0     オールタイム  10500            通常
1              0     オールタイム  10500            通常
2              0     オールタイム  10500            通常
3              0     オールタイム  10500            通常
4              0        ナイト   6000            通常
...          ...        ...    ...           ...
4187           0     オールタイム  10500            通常
4188           0     オールタイム  10500            通常
4189           0        ナイト   6000            通常
4190           0     オールタイム  10500            通常
4191           0      デイタイム   7500            通常

[2953 rows x 11 columns]
[                          'NaT' '2019-03-31T00:00:00.000000000']

In [14]:
customer_newer.groupby('class_name').count()['customer_id']

class_name
オールタイム    1444
デイタイム      696
ナイト        813
Name: customer_id, dtype: int64

In [15]:
customer_newer.groupby('campaign_name').count()['customer_id']

campaign_name
入会費半額     311
入会費無料     242
通常       2400
Name: customer_id, dtype: int64

In [16]:
customer_newer.groupby('gender').count()['customer_id']

gender
F    1400
M    1553
Name: customer_id, dtype: int64

## 025 利用履歴データを集計する

In [41]:
(uselog.isnull()['usedate'] == True).count()
uselog['usedate'] = pd.to_datetime(uselog['usedate'])
uselog['年月'] = uselog['usedate'].dt.strftime("%Y%m")
uselog_months = uselog.groupby(['年月', 'customer_id'], as_index=False).count()
uselog_months.rename(columns={'log_id':'count'}, inplace=True)
del uselog_months['usedate']
uselog_months.head()

       年月 customer_id  count
0  201804    AS002855      4
1  201804    AS009013      2
2  201804    AS009373      3
3  201804    AS015315      6
4  201804    AS015739      7

In [51]:
uselog_customer = uselog_months.groupby('customer_id').agg(['mean', 'median', 'max', 'min'])['count']
uselog_customer

                 mean  median  max  min
customer_id
AS002855     4.500000     5.0    7    2
AS008805     4.000000     4.0    8    1
AS009013     2.000000     2.0    2    2
AS009373     5.083333     5.0    7    3
AS015233     7.545455     7.0   11    4
...               ...     ...  ...  ...
TS995853     9.500000     9.5   11    8
TS998593     8.142857     8.0    9    7
TS999079     4.916667     5.5    9    2
TS999231     4.666667     5.0    8    1
TS999855     4.583333     4.0    7    3

[4192 rows x 4 columns]